const articles = [
  {
    id: 0,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'article',
    category: "أفكار البزنس",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-01.jpg",
    author:
      "عبد الله علي",
    href: "#",
    date: "15/12/2021",
    tags: ['البزنس', 'التجارة الالكترونية'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      }
    ],
  },
  {
    id: 1,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'article',
    category: "أفكار البزنس",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-02.jpg",
    author:
      "عبد الله عادل",
    href: "#",
    date: "15/12/2021",
    tags: ['افكار البزنس'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      }
    ],

  },
  {
    id: 2,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'report',
    category: "أفكار البزنس",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-03.jpg",
    author: "عبد الله عادل",
    href: "#",
    date: "15/12/2021",
    tags: ['افكار البزنس'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      }
    ],
  },
  {
    id: 3,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'article',
    category: "أفكار البزنس",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-01.jpg",
    author:
      "عبدالله عادل",
    href: "#",
    date: "15/12/2021",
    tags: ['افكار البزنس'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      }
    ],
  },
  {
    id: 4,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'article',
    category: "أفكار البزنس",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-02.jpg",
    author:
      "عبد الله عادل",
    href: "#",
    date: "15/12/2021",
    tags: ['افكار البزنس'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      }
    ],
  },
  {
    id: 5,
    title: "ماهو مستقبل التجارة الالكترونية",
    type: 'article',
    category: "التسويق",
    description: "ترليون في عام 2014 إلى 4.5 في عام 2024 من المتوقع ا تريد إلى 1.5",
    imgUrl:
      "https://tailwindui.com/img/ecommerce-images/home-page-02-edition-03.jpg",
    author: "عبد الله عادل",
    body: `<img src='https://s3-alpha-sig.figma.com/img/6bad/5783/aeddf86b1bda33b4b7d26591b1831a17?Expires=1660521600&Signature=VGUJZD5MiRissxTlnO6SAZylGtUZBvjJv45HblNjJyZNcDhCB5ZQLGM83LkfP3cEin2Z-odiO2XftUVdPvjNHHlYnW9a2v4p4UK3LXIhEB77R3ihs9t-0tTQY0GJFxHdosUQJa6~zdXfm-SEIQ5b4sv0r5A4BNO9stvSIt39PrMpP-Cclcjg-ZwRVDbQZFDxvm-eRSC7LOXrQFSVRfRYwx9bEaHbPrFNS-jfJDjwOY5G990rsH40BWP01PvakZA4-uTr~qQDXKKJi3UwwkugvL6fcC7mZ0EeBHp1EW~gYs6W1rZ40uZduhk13~0JhiyE5FLEuja7SJDY4-phTNmVKA__&Key-Pair-Id=APKAINTVSUGEWH5XD5UA' alt='article-1' className=" aspect-video  rounded py-4" />
      <div className=" space-y-6 leading-loose">
      <p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p><p>
      هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
      ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.لأنه مازال نصاً بديلاً ومؤقتاً.
      </p>
      </div>`,
    href: "#",
    date: "15/12/2021",
    tags: ['افكار البزنس'],
    social_links: {
      facebook: "https://facebook.com",
      twitter: "https://twitter.com",
      linkedin: "https://linkedin.com",
    },
    comments: [
      {
        name: "hassan kotti",
        date: "15/12/2021",
        text: "حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء مع تحديد الشريحة المستهدفة بإحترافية وسهولة حرصنا من تمكين التجار من التسويق بشكل قوي وبأدوات سهلة وبسيطة. حيث يمكنك عمل حملات تسويقية وإرسالها للعملاء "
      },
    ],

  },
];
export default articles;